[M_Sage_Mission03 MissionDefinition]
MissionName="I thought of Professor Zhongshan."
MissionDescription="Lord Hammerlock arranged the first skirmish. you are [place]bicycle park[-place] They killed the strange creature hiding in the area.."
TurnInDescription="Find and save...Railway. What are you doing?"
MissionSummary="Let's go hunting."
MissionGiver="Mr. Hammerlock"
MissionTurnInLocation="off one's nuts"
TeaserText=""

[M_Sage_Mission03:FindScaylion MissionObjectiveDefinition]
ProgressMessage="Meet on the big platform"

[M_Sage_Mission03:FindScaylionSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission03:FindVillage MissionObjectiveDefinition]
ProgressMessage="Find a village"

[M_Sage_Mission03:FindVillageSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Find and destroy the wild religions of Nagayama."
MissionDescriptionOverride="On the blue platform, Professor Nakayama convinces you to follow the Hammerlock. With Nakayama's incessant screams, you will experience a tough battle with Hyperion's enemies. Hammerlock claims that D-Beast did it because Nakayama could control Will. We must find the answer where the ants congregate. He did another radio interview. [place]The forest of Scylla[-place]. It's clear he wants to do something... Hammerlock wants you to find and destroy the priceless property. Just don't worry about it later."

[M_Sage_Mission03:KillDeity MissionObjectiveDefinition]
ProgressMessage="Kill the myth"

[M_Sage_Mission03:KillDeitySet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission03:KillScaylion MissionObjectiveDefinition]
ProgressMessage="kills quickly"

[M_Sage_Mission03:KillScaylionSet MissionObjectiveSetDefinition]
MissionSummaryOverride="The place where they were killed."
MissionDescriptionOverride=""

[M_Sage_Mission03:SaveClaptrap MissionObjectiveDefinition]
ProgressMessage="save the carrier"

[M_Sage_Mission03:SaveClaptrapAgain MissionObjectiveDefinition]
ProgressMessage="Please register again from the audience"

[M_Sage_Mission03:SaveClaptrapAgainSet MissionObjectiveSetDefinition]
MissionSummaryOverride="You are defending the seat again.."
MissionDescriptionOverride="Blue confirms that you lost Professor Nakayama and Hammerlock follows him. Thanks to Nakayama's constant screams, you once again find yourself in a fierce battle with your rival Hyperion. As Nakayama tracks the wild animal population, Hammerlock begins to find answers about where the wild animals congregate. I got an email from the other side. [place]Forest of Scylla[-place]. Seeing the worship of wild animals as foolish, he decided to go on vacation to the land of the dead on Pandora. Even though he's a builder, five seconds after seeing him, he's talking nonsense, and the thugs try to kill him. Once you save him, he won't bother you, so you should probably save him.."

[M_Sage_Mission03:SaveClaptrapSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Beware of traps."
MissionDescriptionOverride="The suddenly evil Professor Nakayama finally convinces him and Hammerlock to follow him. As Nakayama continues to cry, you'll once again find yourself in intense combat with Hyperion's opponents. Hammerlock reasoned that Nakayama would look for answers in areas where wild animals congregated, because he might have control over local wildlife populations. At the same time, he also accepted a radio interview. [place]penny tree[-place]. Apparently the savage was praying for something else. That "thing" is Claptrap, who has apparently decided to spend his vacation in the worst place in Pandora. The bad guy tried to kill him because the grandstanding guy looked at him and said something stupid five seconds later..<br>Maybe it would be better to keep it."

